{
    "onset": {
        "LongName": "Onset time of event",
        "Description": "Marks the start of an ongoing event of temporal extent.",
        "Units": "s",
        "HED": "Property/Data-property/Data-marker/Temporal-marker/Onset"
    },
    "duration": {
        "LongName": "The period of time during which an event occurs. Refers to Image duration or response time after stimulus depending on event_type",
        "Description": "a. For falsebelief and falsephoto trial types, duration refers to the image presentations of falsebelief and falsephoto stories. b. For rating_falsebelief and rating_falsephoto, duration refers to the response time to answer true false questions, followed by falsebelief or flasephoto stimulu",
        "Units": "s",
        "HED": "Property/Data-property/Data-value/Spatiotemporal-value/Temporal-value/Duration"
    },
    "event_type": {
        "LongName": "Event category",
        "Description": "Categorical variable of event types within run",
        "Levels": {
            "stimulus": "A text-based story is presented on screen",
            "response": "A question related to text-based story is presented; Participants are prompted to respond True or False to presented question"
        },
        "HED": {
            "stimulus": "Sensory-event, Experimental-stimulus, Visual-presentation, Item/Language-item/Textblock",
            "response": "Property/Task-property/Task-event-role/Participant-response, Action/Think/Judge"
        }
    },
    "value": {
        "LongName": "Stimulus and response type falls under false belief or false photo",
        "Description": "Trial type is either a false belief narrative or false photo narrative",
        "Levels": {
            "falsebelief": "A story where participant is prompted to represent outdated beliefs of an agents’ latent thoughts ('false belief'), e.g. Tom turned left on the main road as usual to get to work, but we know that very road is under construction.",
            "falsephoto": "A story where participant is prompted to represent a false or outdated content from a photo, e.g. an old photograph that depicts the Berlin wall that no longer accurately describes the current state"
        },
        "HED": {
            "falsebelief": "Action/Perform/Read",
            "falsephoto": "Action/Perform/Read"
        }
    },
    "response_accuracy": {
        "LongName": "Correct or Incorrect response",
        "Description": "Correct or Incorrect response in regards to question presented on screen; Options are True or False, presented on screen, underneath question. Participants are promted to respond with MR-compatible button box",
        "Levels": {
            "correct": "Correct response in regards to question",
            "incorrect": "Incorrect response in regards to question"
        },
        "HED": {
            "correct": "Property/Task-property/Task-action-type/Correct-action",
            "incorrect": "Property/Task-property/Task-action-type/Incorrect-action"
        }
    },
    "stim_file": {
        "LongName": "Stimulus filename which is presented on screen",
        "Description": "Given text file encompasses test that is displayed on screen. Filename is designated as {digit}{belief_or_photo}_{story_or_question}.txt. Digit indicates the number of stimulus that was presented. b or p indicates whether stimulus was false belief or false photo event. Story or question indicates which event was presented on screen.",
        "HED": "(Textblock, Pathname/#)"
    }
}