{
    "duration": {
        "Description": "For the two 'rating' trial types, if no response was provided, the duration was imputed from the mouse trajectory data: It is the time point when participants stopped moving the mouse minus the time point when the trial started. In rare cases, participants did not move the mouse at all, no response could be imputed, and the duration would be 'n/a'. If you would like to model the rating period, you can use the maximum time for rating (4 seconds) to replace those missing values", 
        "Units": "s"
    },
    "trial_type": {
        "LongName": "Event category",
        "Description": "A categorical variable indicating event types within a trial",
        "Levels": {
            "narrative_presentation": "when audios or texts of the narratives were presented",
            "rating_feeling": "the rating period for feelings, whose duration is response time",
            "rating_expectation": "the rating period for expectations, whose duration is response time",
            "feeling_mouse_trajectory": "the period when the participant was moving the trackball during the feeling rating",
            "expectation_mouse_trajectory": "the period when the participant was moving the trackball during the expectation rating"
        }, 
        "HED": {
            "narrative_presentation": "Sensory-event, Experimental-stimulus, Auditory-presentation, Visual-presentation",
            "rating_feeling": "Agent-action, Human-agent, Experiment-participant, Participant-response",
            "rating_expectation": "Agent-action, Human-agent, Experiment-participant, Participant-response",
            "feeling_mouse_trajectory": "Agent-action, Human-agent, Experiment-participant, Participant-response",
            "expectation_mouse_trajectory": "Agent-action, Human-agent, Experiment-participant, Participant-response"
        }
    },
    "response_x": {
        "LongName": "The x coordinate of the rating",
        "Description": "The screen coordinate system uses the upper left corner as the origin. Left-right is along the x axis, and up-down is along the y axis. All x and y values on the screen are positive. The rating scale was in a rectangle whose two upper corners are (478, 300) (pole of 'Bad') and (1442, 300) (pole of 'Good'), and two lower corners are (478, 780) and (1442, 780). In each trial, the rating dot started at (960, 707). Then the participant moved the dot to the place they thought was approriate before clicking to lock the rating. The x value of the position of the click was recorded in this column.", 
        "Units": "pixel", 
        "HED": "(X-position/#, Agent-action, (Press, Mouse-button, Scroll-wheel))"
    },
    "response_y": {
        "LongName": "The y coordinate of the rating",
        "Description": "This is the y value of the position of the click during ratings. Note: if no rating was provided by clicking, the value, as well as response_x, was imputed by finding the last time the trackball moved.", 
        "Units": "pixel", 
        "HED": "(Y-position/#, Agent-action, (Press, Mouse-button, Scroll-wheel))"
    },
    "situation": {
        "LongName": "The situation of the narrative in this trial",
        "Description": "There were a total of 32 situations used in the study, sampled from Polti's 36 dramatic situations. Examples include 'Pursuit', 'Adultery', and 'Conflict with a god'.",
        "HED": "Label/#"
    },
    "context": {
        "LongName": "The context where stories happened in this trial",
        "Description": "Contexts in the current study mean the general place of the stories. There were 8 places used: park, hospital, prison, town, city, beach, forest, swamp.", 
        "HED": "Label/#"
    },
    "modality": {
        "LongName": "The modality where narratives were presented in this trial",
        "Description": "There are two modalities used in the study: Audio and Text", 
        "HED": "Label/#"
    },
    "stim_file": {
        "LongName": "The name of the stimulus file in this trial", 
        "HED": "Pathname/#"
    }
}