{
    "onset": {
        "LongName": "Onset time of event",
        "Description": "Marks the start of an ongoing event of temporal extent.",
        "Units": "s",
        "HED": "Property/Data-property/Data-marker/Temporal-marker/Onset"
    },
    "duration": {
        "LongName": "The period of time during which an event occurs. Refers to Image duration or response time after stimulus depending on event_type",
        "Description": "a. For falsebelief and falsephoto trial types, duration refers to the image presentations of falsebelief and falsephoto stories. b. For rating_falsebelief and rating_falsephoto, duration refers to the response time to answer true false questions, followed by falsebelief or flasephoto stimulu",
        "Units": "s",
        "HED": "Property/Data-property/Data-value/Spatiotemporal-value/Temporal-value/Duration"
    },
    "event_type": {
        "LongName": "Event category",
        "Description": "Categorical variable of event types within run",
        "Levels": {
            "dummy": "Study phase items, but intended to be excluded from analysis due to primacy or recency effects. These items are presented in the first three or last three orders",
            "study": "Study phase items: Participants are shown items (e.g., images) to memorize for subsequent testing. This phase aims to encode the items into participants' memory.",
            "test": "Test phase items: Participants are asked to identify previously studied items ('old') and distinguish them from new, unstudied items ('new'), assessing recall and recognition abilities.",
            "distraction_math": "Simple math problems are presented to participants, serving to temporarily divert attention from the study-test sequence. This task is designed to mitigate rehearsal and reduce potential carry-over effects between the study and test phases."
        },
        "HED": {
            "dummy": "Action/Think/Encode",
            "study": "Action/Think/Encode",
            "test": "Action/Think/Recall",
            "distraction_math": "Action/Think/Count"
        }
    },
    "value": {
        "LongName": "The levels of study items and test items",
        "Description": "",
        "Levels": {
            "study_dummy": "Presentation of items to study - the first and the last three items are discarded due to primary/recency effects, indicated as dummy.",
            "study": "Presentation of items to study",
            "test_old": "Test phase items: items that were presented during study phase",
            "test_new": "Test phase items: items that were not presented during study phase; new items presented to participant during test phase",
            "math": "Simple math problems presented during math phase"
        },
        "HED": {
            "study_dummy": "Action/Perform/Read",
            "study": "Action/Think/Encode",
            "test_old": "Action/Think/Recall",
            "test_new": "Action/Think/Recall",
            "math": "Action/Think/Count"
        }
    },
    "response_accuracy": {
        "LongName": "Correct or Incorrect response",
        "Description": "Correct or Incorrect response in regards to question presented on screen; Options are Old and New, presented on screen, underneath image. Participants are promted to respond with MR-compatible button box",
        "Levels": {
            "correct": "Correct response in regards to image (correctly identified as old or new)",
            "incorrect": "Incorrect response in regards to image (incorrectly identified as old or new)"
        },
        "HED": {
            "correct": "Property/Task-property/Task-action-type/Correct-action",
            "incorrect": "Property/Task-property/Task-action-type/Incorrect-action"
        }
    },
    "stim_file": {
        "LongName": "Stimulus filename which is presented on screen",
        "Description": "Given text file encompasses test that is displayed on screen. Filename is designated as {digit}{belief_or_photo}_{story_or_question}.txt. Digit indicates the number of stimulus that was presented. b or p indicates whether stimulus was false belief or false photo event. Story or question indicates which event was presented on screen.",
        "HED": "(Textblock, Pathname/#)"
    },
    "button_press": {
        "LongName": "Key press",
        "Description": "Given text file encompasses test that is displayed on screen. Filename is designated as {digit}{belief_or_photo}_{story_or_question}.txt. Digit indicates the number of stimulus that was presented. b or p indicates whether stimulus was false belief or false photo event. Story or question indicates which event was presented on screen.",
        "Levels": {
            "old": "Participant presses old button to indicate they saw the item during the study phase. Old option is presented on the left side of the screen",
            "new": "Participant presses new button to indicate they did not see the item during the study phase. New option is presented on the right side of the screen"
        },
        "HED": {
            "old": "Action/Move/Move-body-part/Move-upper-extremity/Press",
            "new": "Action/Move/Move-body-part/Move-upper-extremity/Press"
        }
    },
    "reaction_time": {
        "LongName": "Reaction time of responding to test item",
        "Description": "Reaction time is measure as the time of button press minus the time of test item presentation",
        "HED": ""
    }
}