{
    "duration": {
        "Description": "For the 'rating' trial type, if no response was provided, the duration was imputed from the mouse trajectory data: It is the time point when participants stopped moving the mouse minus the time point when the trial started. In rare cases, participants did not move the mouse at all, no response could be imputed, and the duration would be 'n/a'. If you would like to model the rating period, you can use the maximum time for rating (1.875 seconds) to replace those missing values", 
        "Units": "s"
    },
    "trial_type": {
        "LongName": "Event category",
        "Description": "A categorical variable indicating event types within a trial",
        "Levels": {
            "face": "when videos of faces were played",
            "rating": "the rating period",
            "rating_mouse_trajectory": "the period when the participant was moving the trackball during the rating. The onset of this event was when participant began to move the trackball, and the duration is the length of the time when the trackball was being moved. If the onset and duration values for this trial type are 'n/a', that means subjects did not move the trackball at all in this trial."
        }, 
        "HED": {
            "face": "Sensory-event, Experimental-stimulus, Visual-presentation",
            "rating": "Agent-action, Human-agent, Experiment-participant, Participant-response",
            "rating_mouse_trajectory": "Agent-action, Human-agent, Experiment-participant, Participant-response"
        }
    },
    "response_value": {
        "LongName": "The value of the rating",
        "Description": "The ratings were made on a linear scale (see details in the paper). Then all the rating values were converted into the [0 1] range via a simple linear scaling (0 and 1 correspond to the left and right end of the scale, respectively).",
        "HED": "(Fraction/#, Agent-action, (Press, Mouse-button, Scroll-wheel))"
    },
    "rating_type": {
        "LongName": "The type of ratings in this trial",
        "Description": "There were three types of ratings (about the faces) used in this experiment: sex (male to female), age (young to old), and intensity of facial expressions (neutral to strongest imaginable).", 
        "HED": "Label/#"
    },
    "expression": {
        "LongName": "The facial expressions of the face presented in this trial",
        "Description": "Eight kinds of facial expressions were used: happy, pleasure, sad, anger, fear, surprise, disgust, pain", 
        "HED": "Label/#"
    },
    "age": {
        "LongName": "The age of the face presented in this trial",
        "Description": "Two levels of age were used: young and old.", 
        "HED": "Label/#"
    },
    "race": {
        "LongName": "The race of the face presented in this trial",
        "Description": "Three kinds of race were used: African, WC (White Caucassian), and EA (East Asian).", 
        "HED": "Label/#"
    },
    "sex": {
        "LongName": "The sex of the face presented in this trial",
        "Description": "Two levels of sex were used: female and male.", 
        "HED": "Label/#"
    },
    "stim_file": {
        "LongName": "The name of the stimulus file in this trial",
        "HED": "Pathname/#"
    }
}